In [1]:
import pandas as pd
df = pd.read_csv('/home/jagdish/Machine_Learning/Abul_Basar/Datasets/insurance.csv')

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
age         1338 non-null int64
gender      1338 non-null object
bmi         1338 non-null float64
children    1338 non-null int64
smoker      1338 non-null object
region      1338 non-null object
charges     1338 non-null float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.2+ KB

In [3]:
df.head()

   age  gender     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [4]:
df.iloc[:3,:3]

   age  gender    bmi
0   19  female  27.90
1   18    male  33.77
2   28    male  33.00

In [5]:
dict(df.dtypes)

{'age': dtype('int64'),
 'bmi': dtype('float64'),
 'charges': dtype('float64'),
 'children': dtype('int64'),
 'gender': dtype('O'),
 'region': dtype('O'),
 'smoker': dtype('O')}

In [6]:
df.groupby('region').age.mean()

region
northeast    39.268519
northwest    39.196923
southeast    38.939560
southwest    39.455385
Name: age, dtype: float64

In [8]:
df.groupby('region').age.agg(['mean','count']).reset_index()

      region       mean  count
0  northeast  39.268519    324
1  northwest  39.196923    325
2  southeast  38.939560    364
3  southwest  39.455385    325

In [11]:
df.groupby('region').agg({'charges':['mean','median'],'age':['mean','median']}).reset_index()

      region       charges                      age
                      mean        median       mean median
0  northeast  13406.384516  10057.652025  39.268519   39.5
1  northwest  12417.575374   8965.795750  39.196923   39.0
2  southeast  14735.411438   9294.131950  38.939560   39.0
3  southwest  12346.937377   8798.593000  39.455385   39.0

In [12]:
df.groupby(['region','gender']).agg({
    'charges':['mean','median'],'age':['mean','median']
}).reset_index()

      region  gender       charges                     age
                              mean       median       mean median
0  northeast  female  12953.203151  10197.77220  39.639752     40
1  northeast    male  13854.005374   9957.72160  38.901840     39
2  northwest  female  12479.870397   9614.07290  39.591463     40
3  northwest    male  12354.119575   8413.46305  38.795031     38
4  southeast  female  13499.669243   8582.30230  39.108571     39
5  southeast    male  15879.617173   9504.31030  38.783069     39
6  southwest  female  11274.411264   8530.83700  39.703704     40
7  southwest    male  13412.883576   9391.34600  39.208589     39

In [13]:
list1 = [[1,2,3],[4,5,6],[7,8,9]]

In [22]:
su1 = 0
for i in list1:
    print(i)
    su1 = su1 + sum(i)
print(su1)

[1, 2, 3]
[4, 5, 6]
[7, 8, 9]
45